espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_struct.h
/**
 * SPDX-FileCopyrightText: 2022-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#include <stddef.h>
#ifdef __cplusplus
extern "C" {
#endif

#include "soc/soc.h"
#include "soc/pmu_reg.h"

typedef union {
    struct {
        uint32_t reserved0          : 20;
        uint32_t vdd_spi_pd_en      : 1;
        uint32_t pd_hp_alive_pd_en  : 1;
        uint32_t hp_mem_dslp        : 1;
        uint32_t hp_mem_pd_en       : 4;
        uint32_t modem_top_pd_en    : 1;
        uint32_t hp_cnnt_pd_en      : 1;
        uint32_t hp_cpu_pd_en       : 1;
        uint32_t modem_pwr_pd_en    : 1;
        uint32_t top_pd_en          : 1;
    };
    uint32_t val;
} pmu_hp_dig_power_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 30;
        uint32_t code     : 2;
    };
    uint32_t val;
} pmu_hp_icg_modem_reg_t;

typedef union {
    struct {
        uint32_t reserved0      : 23;
        uint32_t c_channel      : 1;
        uint32_t uart_wakeup_en : 1;
        uint32_t lp_pad_hold_all: 1;
        uint32_t hp_pad_hold_all: 1;
        uint32_t dig_pad_slp_sel: 1;
        uint32_t dig_pause_wdt  : 1;
        uint32_t dig_cpu_stall  : 1;
        uint32_t reserved1      : 2;
    };
    uint32_t val;
} pmu_hp_sys_cntl_reg_t;

typedef union {
    struct {
        uint32_t reserved0      : 19;
        uint32_t xpd_xtalx2     : 1;
        uint32_t i2c_iso_en     : 1;
        uint32_t i2c_retention  : 1;
        uint32_t xpd_bb_i2c     : 1;
        uint32_t xpd_cpll_i2c   : 1;
        uint32_t xpd_bbpll_i2c  : 1;
        uint32_t xpd_apll_i2c   : 1;
        uint32_t xpd_mpll_i2c   : 1;
        uint32_t xpd_cpll       : 1;
        uint32_t xpd_bbpll      : 1;
        uint32_t xpd_apll       : 1;
        uint32_t xpd_mpll       : 1;
        uint32_t reserved1      : 1;
    };
    uint32_t val;
} pmu_hp_clk_power_reg_t;

typedef union {
    struct {
        uint32_t reserved0 : 25;
        uint32_t xpd_bias  : 1;
        uint32_t dbg_atten : 4;
        uint32_t pd_cur    : 1;
        uint32_t bias_sleep: 1;
    };
    uint32_t val;
} pmu_hp_bias_reg_t;

typedef union {
    struct {    /* HP: Active State */
        uint32_t reserved0                            : 4;
        uint32_t hp_sleep2active_backup_modem_clk_code: 2;
        uint32_t hp_modem2active_backup_modem_clk_code: 2;
        uint32_t reserved1                            : 2;
        uint32_t hp_active_retention_mode             : 1;
        uint32_t hp_sleep2active_retention_en         : 1;
        uint32_t hp_modem2active_retention_en         : 1;
        uint32_t reserved2                            : 1;
        uint32_t hp_sleep2active_backup_clk_sel       : 2;
        uint32_t hp_modem2active_backup_clk_sel       : 2;
        uint32_t hp_sleep2active_backup_mode          : 5;
        uint32_t hp_modem2active_backup_mode          : 5;
        uint32_t reserved3                            : 1;
        uint32_t hp_sleep2active_backup_en            : 1;
        uint32_t hp_modem2active_backup_en            : 1;
        uint32_t reserved4                            : 1;
    };
    struct {    /* HP: Modem State */
        uint32_t reserved5                            : 4;
        uint32_t hp_sleep2modem_backup_modem_clk_code : 2;
        uint32_t reserved6                            : 4;
        uint32_t hp_modem_retention_mode              : 1;
        uint32_t hp_sleep2modem_retention_en          : 1;
        uint32_t reserved7                            : 2;
        uint32_t hp_sleep2modem_backup_clk_sel        : 2;
        uint32_t reserved8                            : 4;
        uint32_t hp_sleep2modem_backup_mode           : 5;
        uint32_t reserved9                            : 4;
        uint32_t hp_sleep2modem_backup_en             : 1;
        uint32_t reserved10                           : 2;
    };
    struct {    /* HP: Sleep State */
        uint32_t reserved11                           : 6;
        uint32_t hp_modem2sleep_backup_modem_clk_code : 2;
        uint32_t hp_active2sleep_backup_modem_clk_code: 2;
        uint32_t hp_sleep_retention_mode              : 1;
        uint32_t reserved12                           : 1;
        uint32_t hp_modem2sleep_retention_en          : 1;
        uint32_t hp_active2sleep_retention_en         : 1;
        uint32_t reserved13                           : 2;
        uint32_t hp_modem2sleep_backup_clk_sel       : 2;
        uint32_t hp_active2sleep_backup_clk_sel       : 2;
        uint32_t hp_modem2sleep_backup_mode           : 5;
        uint32_t hp_active2sleep_backup_mode          : 5;
        uint32_t hp_modem2sleep_backup_en             : 1;
        uint32_t hp_active2sleep_backup_en            : 1;
    };
    uint32_t val;
} pmu_hp_backup_reg_t;

typedef union {
    struct {
        uint32_t reserved0       : 26;
        uint32_t dig_sysclk_nodiv: 1;
        uint32_t icg_sysclk_en   : 1;
        uint32_t sysclk_slp_sel  : 1;
        uint32_t icg_slp_sel     : 1;
        uint32_t dig_sysclk_sel  : 2;
    };
    uint32_t val;
} pmu_hp_sysclk_reg_t;

/* HP System: HP Regulator0 Register */
typedef union {
    struct {    /* HP: Active State */
        uint32_t reserved0      : 3;
        uint32_t dig_dbias_init : 1;    /* Only HP_ACTIVE mode under hp system is valid */
        uint32_t lp_dbias_vol   : 5;    /* Only HP_ACTIVE mode under hp system is valid */
        uint32_t hp_dbias_vol   : 5;    /* Only HP_ACTIVE mode under hp system is valid */
        uint32_t dbias_sel      : 1;    /* Only HP_ACTIVE mode under hp system is valid */
        uint32_t slp_connect_en : 1;
        uint32_t slp_mem_xpd    : 1;
        uint32_t slp_logic_xpd  : 1;
        uint32_t xpd            : 1;
        uint32_t slp_mem_dbias  : 4;
        uint32_t slp_logic_dbias: 4;
        uint32_t dbias: 5;
    };
    uint32_t val;
} pmu_hp_regulator0_reg_t;

/* HP System: HP Regulator1 Register */
typedef union {
    struct {
        uint32_t reserved0: 8;
        uint32_t drv_b    : 24;
    };
    uint32_t val;
} pmu_hp_regulator1_reg_t;

