espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_struct.h
/* HP System: Xtal Register */
typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t xpd_xtal : 1;
    };
    uint32_t val;
} pmu_hp_xtal_reg_t;

/* HP System Hardware Register Map */
typedef struct pmu_hp_hw_regmap_t {
    pmu_hp_dig_power_reg_t     dig_power;
    struct {
        uint32_t               icg_func;
        uint32_t               icg_apb;
    } icg[2];
    pmu_hp_icg_modem_reg_t     icg_modem;
    pmu_hp_sys_cntl_reg_t      syscntl;
    pmu_hp_clk_power_reg_t     clk_power;
    pmu_hp_bias_reg_t          bias;
    pmu_hp_backup_reg_t        backup_cfg;
    uint32_t                   backup_clock[2];
    pmu_hp_sysclk_reg_t        sysclk;
    pmu_hp_regulator0_reg_t    regulator0;
    pmu_hp_regulator1_reg_t    regulator1;
    pmu_hp_xtal_reg_t          xtal;
} pmu_hp_hw_regmap_t;

/* LP System: LP Regulator0 Register */
typedef union {
    struct {
        uint32_t reserved0:21;
        uint32_t slp_xpd:1;
        uint32_t xpd:1;
        uint32_t slp_dbias:4;
        uint32_t dbias:5;
    };
    uint32_t val;
} pmu_lp_regulator0_reg_t;

/* LP System: LP Regulator1 Register */
typedef union {
    struct {
        uint32_t reserved0:28;
        uint32_t drv_b:4;
    };
    uint32_t val;
} pmu_lp_regulator1_reg_t;

/* LP System: Xtal Register */
typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t xpd_xtal : 1;
    };
    uint32_t val;
} pmu_lp_xtal_reg_t;

/* LP System: LP Dig Power Register */
typedef union {
    struct {
        uint32_t reserved0:30;
        uint32_t mem_dslp:1;
        uint32_t peri_pd_en:1;
    };
    uint32_t val;
} pmu_lp_dig_power_reg_t;

/* LP System: LP CK Power Register */
typedef union {
    struct {
        uint32_t reserved0:28;
        uint32_t xpd_xtal32k:1;
        uint32_t xpd_rc32k:1;
        uint32_t xpd_fosc:1;
        uint32_t pd_osc:1;
    };
    uint32_t val;
} pmu_lp_clk_power_reg_t;

typedef union {
    struct {
        uint32_t reserved0 : 25;
        uint32_t xpd_bias  : 1;
        uint32_t dbg_atten : 4;
        uint32_t pd_cur    : 1;
        uint32_t bias_sleep: 1;
    };
    uint32_t val;
} pmu_lp_bias_reg_t;

/* LP System Hardware Register Map */
typedef struct pmu_lp_hw_regmap_t{
    pmu_lp_regulator0_reg_t    regulator0;
    pmu_lp_regulator1_reg_t    regulator1;
    pmu_lp_xtal_reg_t          xtal;   /* Only LP_SLEEP mode under lp system is valid */
    pmu_lp_dig_power_reg_t     dig_power;
    pmu_lp_clk_power_reg_t     clk_power;
    pmu_lp_bias_reg_t          bias;   /* Only LP_SLEEP mode under lp system is valid */
} pmu_lp_hw_regmap_t;

/* Immediate Control: HP CK Power Register */
typedef union {
    struct {
        uint32_t tie_low_global_xtalx2_icg:1;
        uint32_t tie_low_global_xtal_icg:1;
        uint32_t tie_low_i2c_retention:1;
        uint32_t tie_low_xpd_bb_i2c:1;
        uint32_t reserved0                : 1;
        uint32_t tie_low_xpd_xtalx2:1;
        uint32_t tie_low_xpd_xtal:1;
        uint32_t reserved1                : 18;
        uint32_t tie_high_global_xtalx2_icg:1;
        uint32_t tie_high_global_xtal_icg:1;
        uint32_t tie_high_i2c_retention:1;
        uint32_t tie_high_xpd_bb_i2c:1;
        uint32_t reserved2                : 1;
        uint32_t tie_high_xpd_xtalx2:1;
        uint32_t tie_high_xpd_xtal:1;
    };
    uint32_t val;
} pmu_imm_hp_clk_power_0_reg_t;

typedef union {
    struct {
        uint32_t tie_low_xpd_pll_i2c:4;
        uint32_t tie_low_xpd_pll:4;
        uint32_t tie_low_global_pll_icg:4;
        uint32_t reserved0                : 7;
        uint32_t tie_high_global_pll_icg:4;
        uint32_t tie_high_xpd_pll_i2c:4;
        uint32_t tie_high_xpd_pll:4;
        uint32_t reserved1                : 1;
    };
    uint32_t val;
} pmu_imm_hp_clk_power_1_reg_t;

typedef union {
    struct {
        uint32_t reserved0            : 28;
        uint32_t update_dig_icg_switch: 1;
        uint32_t tie_low_icg_slp_sel  : 1;
        uint32_t tie_high_icg_slp_sel : 1;
        uint32_t update_dig_sysclk_sel: 1;
    };
    uint32_t val;
} pmu_imm_sleep_sysclk_reg_t;

typedef union {
    struct {
        uint32_t reserved0             : 31;
        uint32_t update_dig_icg_func_en: 1;
    };
    uint32_t val;
} pmu_imm_hp_func_icg_reg_t;

typedef union {
    struct {
        uint32_t reserved0            : 31;
        uint32_t update_dig_icg_apb_en: 1;
    };
    uint32_t val;
} pmu_imm_hp_apb_icg_reg_t;

typedef union {
    struct {
        uint32_t reserved0              : 31;
        uint32_t update_dig_icg_modem_en: 1;
    };
    uint32_t val;
} pmu_imm_modem_icg_reg_t;

typedef union {
    struct {
        uint32_t reserved0              : 30;
        uint32_t tie_low_lp_rootclk_sel : 1;
        uint32_t tie_high_lp_rootclk_sel: 1;
    };
    uint32_t val;
} pmu_imm_lp_icg_reg_t;

typedef union {
    struct {
        uint32_t reserved0               : 28;
        uint32_t tie_high_lp_pad_hold_all: 1;
        uint32_t tie_low_lp_pad_hold_all : 1;
        uint32_t tie_high_hp_pad_hold_all: 1;
        uint32_t tie_low_hp_pad_hold_all : 1;
    };
    uint32_t val;
} pmu_imm_pad_hold_all_reg_t;

typedef union {
    struct {
        uint32_t reserved0          : 30;
        uint32_t tie_high_i2c_iso_en: 1;
        uint32_t tie_low_i2c_iso_en : 1;
    };
    uint32_t val;
} pmu_imm_i2c_iso_reg_t;

typedef struct pmu_imm_hw_regmap_t{
    pmu_imm_hp_clk_power_0_reg_t   clk_power_0;
    pmu_imm_hp_clk_power_1_reg_t   clk_power_1;
    pmu_imm_sleep_sysclk_reg_t      sleep_sysclk;
    pmu_imm_hp_func_icg_reg_t       hp_func_icg;
    pmu_imm_hp_apb_icg_reg_t        hp_apb_icg;
    pmu_imm_modem_icg_reg_t         modem_icg;
    pmu_imm_lp_icg_reg_t            lp_icg;
    pmu_imm_pad_hold_all_reg_t      pad_hold_all;
    pmu_imm_i2c_iso_reg_t           i2c_iso;
} pmu_imm_hw_regmap_t;

/* Power Domain Control Register */
typedef union {
    struct {
        uint32_t force_top_reset:1;
        uint32_t force_top_iso:1;
        uint32_t force_top_pu:1;
        uint32_t force_top_no_reset:1;
        uint32_t force_top_no_iso:1;
        uint32_t force_top_pd:1;
        uint32_t pd_top_mask:5;
        uint32_t reserved0     : 16;
        uint32_t pd_top_pd_mask: 5;
    };
    struct {
        uint32_t force_hp_alive_reset: 1;
        uint32_t force_hp_alive_iso: 1;
        uint32_t force_hp_alive_pu: 1;
        uint32_t force_hp_alive_no_reset: 1;
        uint32_t force_hp_alive_no_iso: 1;
        uint32_t force_hp_alive_pd: 1;
        uint32_t pd_hp_alive_mask: 5;
        uint32_t reserved1     : 16;
        uint32_t pd_hp_alive_pd_mask: 5;
    };
    struct {
        uint32_t force_modem_pwr_reset: 1;
        uint32_t force_modem_pwr_iso: 1;
        uint32_t force_modem_pwr_pu: 1;
        uint32_t force_modem_pwr_no_reset: 1;
        uint32_t force_modem_pwr_no_iso: 1;
        uint32_t force_modem_pwr_pd: 1;
        uint32_t pd_modem_pwr_mask: 5;
        uint32_t reserved2     : 16;
        uint32_t pd_modem_pwr_pd_mask: 5;
    };
    struct {
        uint32_t force_hp_cpu_reset: 1;
        uint32_t force_hp_cpu_iso: 1;
        uint32_t force_hp_cpu_pu: 1;
        uint32_t force_hp_cpu_no_reset: 1;
        uint32_t force_hp_cpu_no_iso: 1;
        uint32_t force_hp_cpu_pd: 1;
        uint32_t pd_hp_cpu_mask: 5;
        uint32_t reserved3     : 16;
        uint32_t pd_hp_cpu_pd_mask: 5;
    };
    struct {
        uint32_t force_hp_cnnt_reset: 1;
        uint32_t force_hp_cnnt_iso: 1;
        uint32_t force_hp_cnnt_pu: 1;
        uint32_t force_hp_cnnt_no_reset: 1;
        uint32_t force_hp_cnnt_no_iso: 1;
        uint32_t force_hp_cnnt_pd: 1;
        uint32_t pd_hp_cnnt_mask: 5;
        uint32_t reserved4     : 16;
        uint32_t pd_hp_cnnt_pd_mask: 5;
    };
    struct {
        uint32_t force_modem_top_reset: 1;
        uint32_t force_modem_top_iso: 1;
        uint32_t force_modem_top_pu: 1;
        uint32_t force_modem_top_no_reset: 1;
        uint32_t force_modem_top_no_iso: 1;
        uint32_t force_modem_top_pd: 1;
        uint32_t pd_modem_top_mask: 5;
        uint32_t reserved5     : 16;
        uint32_t pd_modem_top_pd_mask: 5;
    };
    struct {
        uint32_t force_lp_peri_reset: 1;
        uint32_t force_lp_peri_iso: 1;
        uint32_t force_lp_peri_pu: 1;
        uint32_t force_lp_peri_no_reset: 1;
        uint32_t force_lp_peri_no_iso: 1;
        uint32_t force_lp_peri_pd: 1;
        uint32_t reserved6     : 26;
    };
    uint32_t val;
} pmu_power_domain_cntl_reg_t;

