espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_struct.h
typedef union {
    struct {
        uint32_t waiti_rdy         : 1;
        uint32_t stall_rdy         : 1;
        uint32_t reserved0         : 16;
        uint32_t force_stall       : 1;
        uint32_t slp_waiti_flag_en : 1;
        uint32_t slp_stall_flag_en : 1;
        uint32_t slp_stall_wait    : 8;
        uint32_t slp_stall_en      : 1;
        uint32_t slp_reset_en      : 1;
        uint32_t slp_bypass_intr_en: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr0_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t sleep_req: 1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr1_reg_t;

typedef union {
    struct {
        uint32_t wakeup_en: 32;
    };
    uint32_t val;
} pmu_lp_cpu_pwr2_reg_t;

typedef struct pmu_lp_ext_hw_regmap_t{
    pmu_lp_intr_reg_t          int_raw;
    pmu_lp_intr_reg_t          int_st;
    pmu_lp_intr_reg_t          int_ena;
    pmu_lp_intr_reg_t          int_clr;
    pmu_lp_cpu_pwr0_reg_t      pwr0;
    pmu_lp_cpu_pwr1_reg_t      pwr1;
    pmu_lp_cpu_pwr2_reg_t      pwr2;
} pmu_lp_ext_hw_regmap_t;

/* Additional Registers */
typedef union {
    struct {
        uint32_t reserved0    : 30;
        uint32_t lp_trigger_hp: 1;
        uint32_t hp_trigger_lp: 1;
    };
    uint32_t val;
} pmu_hp_lp_cpu_comm_reg_t;

typedef union {
    struct {
        uint32_t reserved0           : 31;
        uint32_t dig_regulator_en_cal: 1;
    };
    uint32_t val;
} pmu_hp_regulator_cfg_reg_t;

typedef union {
    struct {
        uint32_t reserved0 : 11;
        uint32_t last_st   : 7;
        uint32_t target_st : 7;
        uint32_t current_st: 7;
    };
    uint32_t val;
} pmu_main_state_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 13;
        uint32_t backup_st: 5;
        uint32_t lp_pwr_st: 5;
        uint32_t hp_pwr_st: 9;
    };
    uint32_t val;
} pmu_pwr_state_reg_t;

typedef union {
    struct {
        uint32_t ext_wakeup_lv:21;
        uint32_t reserved0: 11;
    };
    uint32_t val;
} pmu_ext_wakeup_lv_reg_t;

typedef union {
    struct {
        uint32_t ext_wakeup_sel:21;
        uint32_t reserved0: 11;
    };
    uint32_t val;
} pmu_ext_wakeup_sel_reg_t;

typedef union {
    struct {
        uint32_t ext_wakeup_status:21;
        uint32_t reserved0: 11;
    };
    uint32_t val;
} pmu_ext_wakeup_st_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 30;
        uint32_t ext_wakeup_status_clr: 1;
        uint32_t ext_wakeup_filter: 1;
    };
    uint32_t val;
} pmu_ext_wakeup_cntl_reg_t;

typedef union {
    struct {
        uint32_t sdio_act_dnum:10;
        uint32_t reserved0: 22;
    };
    uint32_t val;
} pmu_sdio_wakeup_cntl_reg_t;

typedef union {
    struct {
        uint32_t touch_sleep_cycles:16;
        uint32_t reserved0     : 5;
        uint32_t touch_wait_cycles:9;
        uint32_t touch_sleep_timer_en:1;
        uint32_t touch_force_done:1;
    };
    uint32_t val;
} pmu_touch_pwr_ctrl_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 30;
        uint32_t xpd_perif_i2c: 1;
        uint32_t rstb_perif_i2c: 1;
    };
    uint32_t val;
} pmu_ana_peri_pwr_ctrl_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t pmu_rdn_eco_en: 1;
    };
    uint32_t val;
} pmu_rdn_eco_reg_t;

typedef union {
    struct {
        uint32_t puf_mem_psw:1;
        uint32_t puf_mem_iso:1;
        uint32_t puf_mem_discharge:1;
        uint32_t reserved0: 29;
    };
    uint32_t val;
} pmu_puf_mem_ctrl_reg_t;

typedef union {
    struct {
        uint32_t pd_top_pu_delt_timer:3;
        uint32_t pd_hp_cpu_pu_delt_timer:3;
        uint32_t pd_modem_top_pu_delt_timer:3;
        uint32_t pd_modem_pwr_pu_delt_timer:3;
        uint32_t pd_hp_cnnt_pu_delt_timer:3;
        uint32_t pd_hp_alive_pu_delt_timer:3;
        uint32_t reserved0     : 14;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl8_reg_t;

typedef union {
    struct {
        uint32_t ext_ldo_tie_high:1;
        uint32_t ext_ldo_en_vdet:1;
        uint32_t ext_cur_lim:1;
        uint32_t ext_ldo_mul:3;
        uint32_t ext_ldo_dref:4;
        uint32_t reserved0: 22;
    };
    uint32_t val;
} pmu_ext_ldo_ctrl_reg_t;

typedef union {
    struct {
        uint32_t cpu_pwr_state:6;
        uint32_t io_0p2a_ovdet:1;
        uint32_t reserved0: 25;
    };
    uint32_t val;
} pmu_debug_ro_reg_t;

typedef union {
    struct {
        uint32_t lpcpu_wakeup_cause:32;
    };
    uint32_t val;
} pmu_lpcpu_wakeup_cause_reg_t;

typedef union {
    struct {
        uint32_t backup_wait_target:4;
        uint32_t reserved0: 28;
    };
    uint32_t val;
} pmu_backup_wait_target_reg_t;

typedef union {
    struct {
        uint32_t pmu_date: 31;
        uint32_t clk_en  : 1;
    };
    uint32_t val;
} pmu_date_reg_t;

typedef union {
    struct {
        uint32_t reserved0        : 1;
        uint32_t stable_xpd_xtal  : 1;
        uint32_t reserved1        : 13;
        uint32_t sysclk_slp_sel  : 1;
        uint32_t sysclk_sel      : 2;
        uint32_t sysclk_nodiv    : 1;
        uint32_t icg_sysclk_en   : 1;
        uint32_t icg_modem_switch: 1;
        uint32_t icg_modem_code  : 2;
        uint32_t icg_slp_sel     : 1;
        uint32_t icg_global_xtal : 1;
        uint32_t reserved2       : 1;
        uint32_t ana_i2c_iso_en  : 1;
        uint32_t ana_i2c_retention: 1;
        uint32_t ana_xpd_bb_i2c  : 1;
        uint32_t reserved3       : 2;
        uint32_t ana_xpd_xtal    : 1;
    };
    uint32_t val;
} pmu_clk_state0_reg_t;


typedef union {
    struct {
        uint32_t reserved0        : 16;
        uint32_t stable_xpd_pll_state: 4;
        uint32_t icg_global_pll_state: 4;
        uint32_t ana_xpd_pll_i2c_state: 4;
        uint32_t ana_xpd_pll_state: 4;
    };
    uint32_t val;
} pmu_clk_state3_reg_t;

typedef union {
    struct {
        uint32_t reserved0             : 29;
        uint32_t flash_power_ready: 1;
        uint32_t flash_power_sel_done: 1;
        uint32_t stable_vdd_spi_pwr_drv: 1;
    };
    uint32_t val;
} pmu_vdd_spi_status_reg_t;

