espressif/esp-idf/components/soc/esp32s31/register/soc/pmu_struct.h
typedef union {
    struct {
        uint32_t flash_sw_power_sel:1;
        uint32_t flash_power_sel_sw_ctrl:1;
        uint32_t flash_switch_time:10;
        uint32_t flash_stable_time:10;
        uint32_t flash_cooldown_time:10;
    };
    uint32_t val;
} pmu_vdd_spi_cfg_reg_t;

typedef union {
    struct {
        uint32_t flash_discharge_time:10;
        uint32_t reserved0: 22;
    };
    uint32_t val;
} pmu_vdd_spi_discharge_cfg_reg_t;

typedef union {
    struct {
        uint32_t sdio_sw_power_sel:1;
        uint32_t sdio_power_sel_sw_ctrl:1;
        uint32_t sdio_switch_time:10;
        uint32_t reserved0: 20;
    };
    uint32_t val;
} pmu_vdd_sdio_cfg_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 31;
        uint32_t psram_xpd: 1;
    };
    uint32_t val;
} pmu_psram_cfg_reg_t;

typedef union {
    struct {
        uint32_t reserved0: 16;
        uint32_t hpcore1_sw_stall_code: 8;
        uint32_t hpcore0_sw_stall_code: 8;
    };
    uint32_t val;
} pmu_cpu_stall_sw_reg_t;

/* Main PMU Device Structure */
typedef struct pmu_dev_t {
    volatile pmu_hp_hw_regmap_t     hp_sys[3];
    volatile pmu_lp_hw_regmap_t     lp_sys[2];
    volatile pmu_imm_hw_regmap_t    imm;
    volatile pmu_power_hw_regmap_t  power;
    volatile pmu_wakeup_hw_regmap_t wakeup;
    volatile pmu_hp_ext_hw_regmap_t hp_ext;
    volatile pmu_lp_ext_hw_regmap_t lp_ext;

    union {
        struct {
            uint32_t reserved0    : 30;
            volatile uint32_t lp_trigger_hp: 1;
            volatile uint32_t hp_trigger_lp: 1;
        };
        volatile uint32_t val;
    } hp_lp_cpu_comm;

    union {
        struct {
            uint32_t reserved0           : 31;
            volatile uint32_t dig_regulator_en_cal: 1;
        };
        volatile uint32_t val;
    } hp_regulator_cfg;

    union {
        struct {
            uint32_t reserved0 : 11;
            volatile uint32_t last_st   : 7;
            volatile uint32_t target_st : 7;
            volatile uint32_t current_st: 7;
        };
        volatile uint32_t val;
    } main_state;

    union {
        struct {
            uint32_t reserved0: 13;
            volatile uint32_t backup_st: 5;
            volatile uint32_t lp_pwr_st: 5;
            volatile uint32_t hp_pwr_st: 9;
        };
        volatile uint32_t val;
    } pwr_state;

    volatile pmu_clk_state0_reg_t            clk_state0;
    volatile uint32_t                        clk_state1;
    volatile uint32_t                        clk_state2;
    volatile pmu_clk_state3_reg_t            clk_state3;
    volatile pmu_vdd_spi_status_reg_t        vdd_spi_status;
    volatile pmu_vdd_spi_cfg_reg_t           vdd_spi_cfg;
    volatile pmu_vdd_spi_discharge_cfg_reg_t vdd_spi_discharge_cfg;
    volatile pmu_vdd_sdio_cfg_reg_t          vdd_sdio_cfg;
    volatile pmu_psram_cfg_reg_t             psram_cfg;
    volatile pmu_cpu_stall_sw_reg_t          cpu_stall_sw;
    volatile pmu_ext_wakeup_lv_reg_t         ext_wakeup_lv;
    volatile pmu_ext_wakeup_sel_reg_t        ext_wakeup_sel;
    volatile pmu_ext_wakeup_st_reg_t         ext_wakeup_st;
    volatile pmu_ext_wakeup_cntl_reg_t       ext_wakeup_cntl;
    volatile pmu_sdio_wakeup_cntl_reg_t      sdio_wakeup_cntl;
    volatile pmu_touch_pwr_ctrl_reg_t        touch_pwr_ctrl;
    volatile pmu_ana_peri_pwr_ctrl_reg_t     ana_peri_pwr_ctrl;
    volatile pmu_rdn_eco_reg_t               rdn_eco;
    volatile pmu_puf_mem_ctrl_reg_t          puf_mem_ctrl;
    volatile pmu_slp_wakeup_cntl8_reg_t      slp_wakeup_cntl8;
    volatile pmu_ext_ldo_ctrl_reg_t          ext_ldo_ctrl;
    volatile pmu_debug_ro_reg_t              debug_ro;
    volatile pmu_lpcpu_wakeup_cause_reg_t    lpcpu_wakeup_cause;
    volatile pmu_backup_wait_target_reg_t    backup_wait_target;
    uint32_t reserved[117];
    volatile pmu_date_reg_t pmu_date;
} pmu_dev_t;

extern pmu_dev_t PMU;

#ifndef __cplusplus
_Static_assert(sizeof(pmu_dev_t) == 0x400, "Invalid size of pmu_dev_t structure");
#endif

_Static_assert(offsetof(pmu_dev_t, reserved) == (PMU_BACKUP_WAIT_TARGET_REG - DR_REG_PMU_BASE) + 4, "Invalid size of pmu_dev_t structure");

#ifdef __cplusplus
}
#endif
